app/views/issues/index.html.erb

UPDATE `issues` SET `priority` = 2, `status` = 'closed', `updated_at` = '2019-06-11 12:53:26' WHERE `issues`.`id` = 1
---
           <td><%= issue.submitted_by %></td>
           <td><%= issue.updated_at %></td>