app/controllers/issues_controller.rb

SELECT `issues`.* FROM `issues` WHERE (1=1 and updated_at >  '2018-01-01' and updated_at < '2019-06-01' and status like '%open%')
---
  def search
    if params[:query].present?
        search_input = params[:query].include?('&') ? params[:query].split('&') : [params[:query]]
        @conditions = "1=1" # return all result
        search_keys = search_input.each do |search_key|
            parse_key = search_key.split(':')
            key = parse_key[0]
            value = parse_key[1]
            next unless ALLOWED_ATTRIBUTES.include? key.to_sym
            @conditions << construct_sql_query(key, value)
        end
        @issues = Issue.where(@conditions).to_a

SELECT `issues`.* FROM `issues`
UPDATE `issues` SET `priority` = 2, `status` = 'closed', `updated_at` = '2019-06-11 12:53:26' WHERE `issues`.`id` = 1
---
  def update
    if params[:issue].present? && @issue.update_attributes(params[:issue].symbolize_keys)

SELECT  `issues`.* FROM `issues` WHERE `issues`.`id` = 1 LIMIT 1
---
    def load_object
      @issue = Issue.where(id: params["id"].to_i || params[:id].to_i).first

SELECT `issues`.* FROM `issues`
---
    def load_objects
      @issues = Issue.all.to_a